{
  "id": 59,
  "date": "2012-02-23",
  "duration": "01:15:22",
  "people": [
    {
      "name": "Kahlil Lechelt",
      "team": [
        "2011-08-25",
        "2013-03-01"
      ],
      "twitter": "https://twitter.com/distilledhype",
      "web": "http://distilledhype.com/"
    },
    {
      "name": "Hans Christian Reinl",
      "team": [
        "2011-11-03"
      ],
      "twitter": "https://twitter.com/drublic",
      "web": "http://drublic.de/"
    },
    {
      "name": "Peter Kröner",
      "team": [
        "2010-11-02"
      ],
      "twitter": "https://twitter.com/sir_pepe",
      "web": "http://peterkroener.de/"
    }
  ],
  "href": "http://workingdraft.de/59/",
  "audio": "http://workingdraft.de/podpress_trac/web/1038/0/wd-59.mp3",
  "title": "Wie ticken Webentwickler?",
  "description": "Aus akutem Mangel an aktuellen Themen haben Hans, Kahlil und Peter spontan eine Sondersendung eingeschoben. Da letzterer demnächst HTML5 an Entwickler vermitteln soll, die bisher keine Erfahrung mit Web-Frontendentwicklung haben, stellte sich die Frage, wie Webentwickler überhaupt mit der Realität im WWW klarkommen. Anders als „normale“ Programmierer kennt der Web-Nerd keine festen Zielplattformen, die einzelnen Technologien mutieren ohne engere Abstimmung miteinander vor sich hin, es gibt keine irgendwie gearteten „offiziellen“ Tools, keine zentrale Dokumentation und so weiter. Auf der Suche nach des Pudels Kern haben wir dann einfach die Aufnahme mitlaufen lassen und erklären das Ergebnis unserer Diskussion zur Revision 59.",
  "topics": [
    {
      "title": "Mozilla Developer Network",
      "href": "https://developer.mozilla.org/",
      "time": "00:02:40",
      "description": "MDN ist das, was einer umfassenden Dokumentation von Webtechnologie noch am nächsten kommt."
    },
    {
      "title": "Writing forward-compatible websites",
      "href": "https://developer.mozilla.org/Writing_Forward_Compatible_Websites",
      "time": "00:04:30",
      "description": "Brendan Eich erklärt, wie man Webseiten baut, die auch in 10 Jahren noch funktionieren."
    },
    {
      "title": "& [01:06:55] Code Kit und Live Reload",
      "href": "http://incident57.com/codekit/",
      "time": "01:02:30",
      "description": "Zwei Tools, die beim Umgang mit Präprozessoren nicht verzichtbar sind (behauptet jedenfalls die Mac-Fraktion)"
    },
    {
      "title": "Git Tower",
      "href": "http://www.git-tower.com/",
      "time": "01:04:25",
      "description": "Ohne Git Tower würde Hans Git als Zumutung empfinden."
    },
    {
      "title": "Sublime Text 2",
      "href": "http://www.sublimetext.com/",
      "description": "Der aktuell trendigste Texteditor für Webentwickler."
    },
    {
      "title": "Gesammelte Erkenntnisse und Thesen",
      "description": "<ul>\n<li>Um über Webtechnologie informiert zu sein, muss man sich in den Informationsfluss (Twitter, Blogs usw.) einklinken und drinbleiben.</li>\n<li>Kleine, spezialisierte Tools helfen dabei, viele verschiedene (und sich ständig ändernde) Probleme zu jonglieren.</li>\n<li>Eine offene Community mit geringen Einstiegshürden trägt viele Informationen nach außen und produziert das Wissen, das anderswo offizielle Dokumentationen bereitstellen.</li>\n<li>Man muss jederzeit flexibel sein, Neues lernen und Altes vergessen.</li>\n<li>Das latente Design-Fanboytum der Webentwickler rührt daher, dass sie so oft Tools wechseln. Wir haben keine Zeit für schlechte Software!</li>\n</ul>"
    }
  ]
}